app/controllers/projects_controller.rb

  def feed
    if params[:gh_username]
      user = User.find_by(gh_username: params[:gh_username])
    end
    projects_of_type = Project.includes(:user, :comments, :contributors).where(:status => params[:status]).active.map { |project|
      {
          :anon => project.anon,
          :title => project.title,
          :subtitle => project.subtitle,
          :created_at => project.created_at.utc.iso8601,
          :id => project.id,
          :uuid => project.uuid,
          :vote_count => project.vote_count,
          :total_contributors => project.contributors.count,
          :license => project.license,
          :privacy => project.privacy,
          :langs_and_frames => project.langs_and_frames,
          :owner_gh_username => project.get_owner_gh_username, # the reason for .includes(:user)
---
SELECT "contributors".* FROM "contributors" WHERE "contributors"."project_id" = 32