app/controllers/projects_controller.rb

  def create
    attr_accessible :title, :user_id, :uuid, :repo_name, :description, :vote_count, :contributors, :license, :status, :seeking, :anon

    @user = User.find_by_uuid(params[:user_uuid])

    @project = Project.new(:title => params[:title],
                           :user_id => @user.id,
                           :uuid => UUIDTools::UUID.random_create.to_s,
                           :repo_name => params[:repo_name],
                           :description => params[:description],
                           :vote_count => 0,
                           :license => params[:license],
                           :status => params[:status],
                           :seeking => params[:seeking],
                           :anon => params[:anon])
      @project.save
---
INSERT INTO "projects" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sun, 05 Jul 2015 19:08:01 UTC +00:00], ["title", nil], ["updated_at", Sun, 05 Jul 2015 19:08:01 UTC +00:00]]

  def feed
    all_projects = Project.all
---
SELECT "projects".* FROM "projects"

  def update
    @project = Project.find(params[:id])

    if @project.update_attributes(:title => params[:title])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "20"]]
UPDATE "projects" SET "title" = 'Updated', "updated_at" = '2015-07-06 03:10:00.612162' WHERE "projects"."id" = 20

  def destroy
    @project = Project.find(params[:id])

    if @project
      @project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "20"]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 20]]