app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "gh_username", "name", "password", "updated_at", "username", "uuid") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    if check_username_availability(params[:username].downcase)
      render :json => {:login_allowed => false}
    else
      @user = User.new(:uuid => UUIDTools::UUID.random_create.to_s,
                       :username => params[:username],
                       :email => params[:email],
                       :password => params[:password])
      @user.save

SELECT COUNT(*) FROM "users" WHERE "users"."username" = 'ben' AND "users"."password" = 'asdf'
---
  def login
    username_or_email = params[:username_or_email].downcase
    password = params[:password]

    if !User.username_login(username_or_email, password).empty? || !User.email_login(username_or_email, password).empty?

SELECT "users".* FROM "users" WHERE "users"."gh_username" = 'whittlbc' LIMIT 1
---
  def get_by_gh_username

    user = User.find_by_gh_username(params[:gh_username])